# Rebar Create Free Form(Document, Rebar Bar Type, Element, IList IList Curve , Rebar Style) Method

Source: https://www.revitapidocs.com/2026/aec398ad-d9c3-b85c-c5f5-fec5dc068831.htm

---

| Rebar Create Free Form(Document, Rebar Bar Type, Element, IList IList Curve , Rebar Style) Method |
| --- |

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static RebarFreeFormCreationResult CreateFreeForm(
	Document doc,
	RebarBarType barType,
	Element host,
	IList<IList<Curve>> curves,
	RebarStyle style
)
```

```
Public Shared Function CreateFreeForm (
	doc As Document,
	barType As RebarBarType,
	host As Element,
	curves As IList(Of IList(Of Curve)),
	style As RebarStyle
) As RebarFreeFormCreationResult
```

```
public:
static RebarFreeFormCreationResult^ CreateFreeForm(
	Document^ doc,
	RebarBarType^ barType,
	Element^ host,
	IList<IList<Curve^>^>^ curves,
	RebarStyle style
)
```

```
static member CreateFreeForm :
        doc : Document *
        barType : RebarBarType *
        host : Element *
        curves : IList<IList<Curve>> *
        style : RebarStyle -> RebarFreeFormCreationResult
```

#### Parameters

doc Document
barType RebarBarType
host Element
curves IList IList Curve
style RebarStyle

#### Return Value

RebarFreeFormCreationResult See Also

#### Reference

Rebar Class CreateFreeForm Overload Autodesk.Revit.DB.Structure Namespace